spec/vcr_cassettes/PaymentGatewayRequest/_save/on_success/sends_the_request_to_the_gateway_and_exposes_the_returned_attributes.yml

---
http_interactions:
- request:
    method: post
    uri: https://ws.sandbox.pagseguro.uol.com.br/v2/checkout
    body:
      encoding: US-ASCII
      string: abandonURL=http%3A%2F%2Fexample.com%2Fbet%2Fpayment&charset=UTF-8&currency=BRL&email=rodrigo%40pittlandia.net&itemAmount1=25.00&itemDescription1=Minha+aposta+no+Bol%C3%A3o+PiTTl%C3%A2ndia+Copa+do+Mundo+2014&itemId1=2&itemQuantity1=1&itemWeight1=0&notificationURL=http%3A%2F%2Fexample.com%2Fpayment_notifications&redirectURL=http%3A%2F%2Fexample.com%2Fbet%2Fpayment&reference=bet_2&token=155F0B5A2C214CE98071AA4D4D3E311C
    headers:
      Accept-Encoding:
      - gzip,deflate
      Accept:
      - "*/*"
      User-Agent:
      - Aitch/0.3.0 (http://rubygems.org/gems/aitch)
      Lib-Description:
      - ruby:2.0.5
      Language-Engine-Description:
      - ruby:2.1.1
      Accept-Charset:
      - UTF-8
      Content-Type:
      - application/x-www-form-urlencoded; charset=UTF-8
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 22 May 2014 19:34:39 GMT
      Server:
      - Apache-Coyote/1.1
      Content-Type:
      - application/xml;charset=ISO-8859-1
      Cache-Control:
      - max-age=180
      Expires:
      - Thu, 22 May 2014 19:37:38 GMT
      Vary:
      - User-Agent
      Connection:
      - close
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="ISO-8859-1" standalone="yes"?><checkout><code>9D13E4D79F9F9D099494BFB298260DE7</code><date>2014-05-22T16:34:39.000-03:00</date></checkout>
    http_version: 
  recorded_at: Thu, 22 May 2014 19:34:41 GMT
recorded_with: VCR 2.9.0
